basecase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;
xmin -0.2;
xmax 0.2;
zmin -0.05;
zmax 0.85;
ymin -0.2;
ymax 0.2;
vertices
(
    ( $xmin $ymin $zmin)
    ( $xmax $ymin $zmin)
    ( $xmax $ymax $zmin)
    ( $xmin $ymax $zmin)
    ( $xmin $ymin $zmax)
    ( $xmax $ymin $zmax)
    ( $xmax $ymax $zmax)
    ( $xmin $ymax $zmax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 100 225) simpleGrading (1 1 1) //2.25
);

edges
(
);

boundary
(
    allBoundary
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
