basecase/constant/omega
omega 10.4719755;
#inputMode merge;