basecase/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../constant/viscosity" 
transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] $viscosity;				//25°C

rhoInf         rhoInf [1 -3 0 0 0 0 0] 997.5;

rho				rho [1 -3 0 0 0 0 0] 997.5;

DT             	DT [ 0 2 -1 0 0 0 0] 1e-9;

// ************************************************************************* //
