basecase/constant/viscosity
viscosity 0.6959e-06;
density  993.3;
#inputMode merge
