basecase/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2;

boundaryField
{
    wall
    {
        type            omegaWallFunction;
        value           uniform 2;
    }
    shaft
    {
        type            omegaWallFunction;
        value           uniform 2;
    }
    stirrer
    {
        type            omegaWallFunction;
        value           uniform 2;
    }
    lid
    {
        type            symmetry;
    }
}


// ************************************************************************* //
