basecase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default            none;
    div(phi,U)      Gauss  vanLeerV;
    div(phi,k)     Gauss upwind;
    div(phi,epsilon) Gauss upwind;
	div(phi,omega) Gauss upwind; 
	div((nuEff*dev2(T(grad(U))))) Gauss linear;

}
laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default        corrected;//limited 1;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
